In [1]:
import psycopg2 as pg
import pandas as pd

In [20]:
#задаем параметры подключения
params = {'host':'ls-a833d1ea50155e0e4cd564423275ff4817f83961.chcsmqxxii7h.eu-central-1.rds.amazonaws.com',
    'port':'5432',
    'database':'postgres',
    'user':'dbmasteruser',
    'password':'>]c[p{Jfqbb&hs,A%s5>$tz9<DE#1qtG'    
}
#здесь подкл.чаемся к тестовой БД в облаке AWS из курсов Data Learn

In [21]:
#создаем коннектор
conn = pg.connect(**params)

In [5]:
#conn = pg.connect(
 #   host='ls-a833d1ea50155e0e4cd564423275ff4817f83961.chcsmqxxii7h.eu-central-1.rds.amazonaws.com',
  #  port='5432',
   # database='postgres',
    #user='dbmasteruser',
    #password='>]c[p{Jfqbb&hs,A%s5>$tz9<DE#1qtG')

In [22]:
#создаем курсор
cursor = conn.cursor()

In [23]:
#создаем запрос
query = 'select * from dw.shipping_mode_dim'

In [24]:
cursor.execute(query)

In [25]:
rows = cursor.fetchall()

In [26]:
rows

[(101, 'Standard Class'),
 (102, 'Second Class'),
 (103, 'Same Day'),
 (104, 'First Class')]

In [27]:
df = pd.DataFrame(rows)
df

     0               1
0  101  Standard Class
1  102    Second Class
2  103        Same Day
3  104     First Class

In [30]:
# выбираем имена колонок из таблицы
cursor.execute('select * from dw.shipping_mode_dim limit 0')
colnames = [desc[0] for desc in cursor.description]

In [35]:
df.columns= colnames
df

   shipping_mode_id            mode
0               101  Standard Class
1               102    Second Class
2               103        Same Day
3               104     First Class

In [40]:
cursor.close()
conn.close()